{"id":1,"title":"Home","name":null,"slug":"home","summary":null,"body":"Photography preserves the most precious memories of our lives forever, whether it's our wedding days, engagements, or all those special times with our families.\n\nOur memories might fade, but our photos will last forever. That's why I believe photography is not only amazing, but essential too.\n\nI absolutely love capturing those precious relationship moments, be it between the bride and groom, or family and friends. What's important to me is capturing emotions that will be frozen in time forever, in the knowledge of how precious those images will be for many generations to come.\n\nMy style is very natural, and my aim is to be as discreet as possible and blend into the background. I truly believe that people look their best when they forget the camera is there, and they are at their most natural and relaxed.\n\nI am a Jersey girl, born and bred, and a Jersey wedding and family photographer based in the Channel Islands. I always feel very privileged and excited at the prospect of covering more weddings and family photoshoots here in Jersey, Guernsey, France and further afield.\n\nNaturally, please feel free to get in touch if you’re looking for a wedding or family photographer to capture your beautiful memories. I always welcome the opportunity to meet with you and chat about your big day.","body_prefix":null,"body_suffix":null,"published":true,"posts":[],"images":[{"id":522,"path":"\/storage\/images\/0aac0144a6c8416cbb27e3dbeee49b40.jpeg","name":"Website Becky.jpg"},{"id":524,"path":"\/storage\/images\/be64cdd52445420592263c80a759a5c9.jpeg","name":"Website Becky-2.jpg"},{"id":523,"path":"\/storage\/images\/8e537f6aef374f609da41326494a2beb.jpeg","name":"Website Becky-3.jpg"},{"id":582,"path":"\/storage\/images\/02e31f8abca2411d8df394dac991d028.jpeg","name":"Harriet-Correct-smaller.jpg"},{"id":55,"path":"\/storage\/images\/1e42750935194ccc95ca8b020f54560d.jpeg","name":"W-TW-0136.jpg"},{"id":605,"path":"\/storage\/images\/4d0b489e28ef4bb1a0aeb9073fe507d1.jpeg","name":"Ellen-Smaller.jpg"},{"id":53,"path":"\/storage\/images\/644745f3ceb5477db066e3dba2ba8333.jpeg","name":"W-TW-0058.jpg"},{"id":52,"path":"\/storage\/images\/79360aa39b984363a11137209d83b5b2.jpeg","name":"W-SB-13-0439.jpg"},{"id":51,"path":"\/storage\/images\/53cd4b5f073847bfa083ed69ed296442.jpeg","name":"W-SB-13-0095.jpg"}]}