{"id":8,"title":"Testimonials","name":"Testimonials","slug":"testimonials","summary":null,"body":null,"body_prefix":null,"body_suffix":null,"published":true,"posts":[{"id":25,"title":"Becky & Karl's Testimonial","slug":"becky-karls-testimonial","summary":null,"body":"Poppy was AMAZING and could not recommend highly enough! Poppy captured beautiful photos of our special day and made us all feel very relaxed and made photo time good fun and seamless. Most of the time you wouldn't even know Poppy was there! Thank you again Poppy, you are one talented lady!","body_prefix":null,"body_suffix":null,"images":[{"id":533,"path":"\/storage\/images\/7492b37bb834410b8393ac78ea3630a3.jpeg","name":"Website Becky-3.jpg"}]},{"id":13,"title":"Donna & Steve's Testimonial","slug":"donna-steves-testimonial","summary":null,"body":"We could not be happier with the amazing photos from our wedding day. Poppy is not only a fantastic photographer but incredibly professional. She listened to what we wanted from a photographer and the style of photos we wanted.\n\nIn the nicest possible way we barely noticed she was there on the day, and she captured the real feeling of our wedding. We genuinely cannot recommend her highly enough, you will not be disappointed!","body_prefix":null,"body_suffix":null,"images":[{"id":241,"path":"\/storage\/images\/bbe877203adf4eb685f62a5e546c0c47.jpeg","name":"W-PC-0225_1000x667.jpg"}]},{"id":8,"title":"Natalie & Tony's Testimonial","slug":"natalie-tonys-testimonial","summary":null,"body":"We weren't going to have a photographer as really couldn't afford it, but we decided quite last minute that in fact it was something we should fork out for. Thank goodness we did, and thank goodness we found Poppy!\n\nWe've watched the slideshow countless times and it brings back all the memories. We're spoiled for choice on what image to use on our thank you cards, and what prints to have, and considering how much I normally hate photos of myself, this is quite a feat! Poppy has captured special little moments from most of the wedding party, not just the bride and groom.\n\nI think the best compliment I can give is from my good friend who lives in Australia who could not make it to the wedding, she watched the slideshow and said \"Photos are amazing. Such a beautiful wedding. Everything looked perfect, I feel like I was there. You really get a feel for the day from the pictures.","body_prefix":null,"body_suffix":null,"images":[{"id":235,"path":"\/storage\/images\/388a0c6c1728448bacbba0c67a87c6bc.jpeg","name":"IMG_5550_1000x667.jpg"}]},{"id":15,"title":"Ellen & Alex's Testimonial","slug":"ellen-alexs-testimonial","summary":null,"body":"From the very first contact with Poppy, to then meeting with her, to having her there on our day and finally to seeing the incredible images she captured, we couldn't be more happy with the service she provided.\n\nNot only do we feel that she is beyond excellent, but a number of our guests have also commented on her, both personally and professionally. She made us feel completely comfortable, which really comes across in the images and her eye for special moments has resulted in some truly memorable pictures.\n\nThank you so much Poppy, if only we could get married again!","body_prefix":null,"body_suffix":null,"images":[{"id":243,"path":"\/storage\/images\/6b9081f8e8094c78b1ed491e35460538.jpeg","name":"W-TW-0274_1000x667.jpg"}]},{"id":4,"title":"Carly & Ramsay","slug":"carly-ramsay","summary":null,"body":"Having looked at Poppy’s previous work, we knew she was a talented photographer. However, when we sat down to view our wedding photographs – carefully crafted as a slideshow to music – we were blown away by the quality. It truly felt as though we had been transported back to our special day and a flood of memories came rushing back with every breath-taking shot. Poppy captured the precious moments between us, from a hearty giggle during the speeches to a teary look of pure joy as we said our vows. \n\nWe were astounded at how beautifully Poppy had captured the atmosphere of the wedding, and she was so discreet that our guests had no idea they were being photographed. Poppy really does have an eye for the best light and backdrop to make the most impressive pictures. Knowing that we didn’t want to take too long for posed shots, Poppy ensured that the family snaps were done efficiently so we could spend more time with our guests. \n\nHer relaxed yet assertive approach resulted in a stunning collection of pictures that are unique to us and our wedding day. Your wedding photographs are something to treasure for years to come so you need to have the best person behind that camera. And Poppy is, in our opinion, the best.","body_prefix":null,"body_suffix":null,"images":[{"id":493,"path":"\/storage\/images\/50b4f2b6b2fb4bd68947498d6ebb101b.jpeg","name":"W-LC-103_1000x667.jpg"}]},{"id":9,"title":"Ruth & Martyn's Testimonial","slug":"ruth-martyns-testimonial","summary":null,"body":"Poppy’s expertise, professionalism and enthusiasm are excellent and our photos could not have been better.   For us, the most impressive element is Poppy’s understanding of what makes a great wedding photo. She seamlessly and discreetly photographed all of the key members of the wedding party and has a great talent for capturing fantastic moments. \n\nWe were keen not to spend a lot of time posing for photos and Poppy made sure that all the group shots were completed within ten minutes which left more time for us to enjoy the celebrations.  The final result is a set of photos that are relaxed, fun and really capture the day as we remember it.","body_prefix":null,"body_suffix":null,"images":[{"id":540,"path":"\/storage\/images\/437804d7bb084f89b16b961c12559994.jpeg","name":"Website size-53.jpg"}]},{"id":10,"title":"Sue & James's Testimonial","slug":"sue-jamess-testimonial","summary":null,"body":"Poppy is a vibrant, imaginative and talented photographer. She played an integral part in our wedding day and made us feel relaxed and almost unaware of her presence. She photographed the ceremony at midday and then returned to take some shots of us on the headland in front of the Atlantic Hotel.\n\nWe are delighted with the results. She has captured the spirit of the day and provided us with the most wonderful memories of a magical time. We have no hesitation in highly recommending Poppy to you.","body_prefix":null,"body_suffix":null,"images":[{"id":535,"path":"\/storage\/images\/2afe18f68d354c0986ad38ebe0ddb98f.jpeg","name":"Website Becky-2.jpg"}]},{"id":12,"title":"Joanna & Richard's Testimonial","slug":"joanna-richards-testimonial","summary":null,"body":"When we first met Poppy we instantly knew that she was the perfect choice to capture our wedding day in a natural and relaxed manner. The results were beyond expectations and completely took our breath away. The photographs capture our emotions and that of our guests in such a unique and special way that brings each moment to life.\n\nLooking at the photographs over and over again is addictive, they just bring the happiest of memories and laughter flooding back. Poppy is not only incredibly talented, she is an absolute pleasure to work with, has a discreet air of confidence and professionalism, perfectly balanced with her ability to adapt to suit our wishes. The end product is truly outstanding.","body_prefix":null,"body_suffix":null,"images":[{"id":240,"path":"\/storage\/images\/0e18050f21474448a8c2cf493c4609ad.jpeg","name":"W-BV-0130_1000x667.jpg"}]},{"id":14,"title":"James & Lindsey's Testimonial","slug":"james-lindseys-testimonial","summary":null,"body":"We were astonished not only by the beauty of the wedding photos we received from Poppy but also by her unparalleled ability to capture the emotion of the day, the way she brought the pictures to life was truly unique. \n\nWe barely noticed Poppy throughout the entire wedding; she was never positioning people or adjusting poses. She faded into the background and from there managed to capture the most exquisite shots.\n\nWe love every single photo from our wedding day and would highly recommend her services to anyone. Thank you Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":242,"path":"\/storage\/images\/f34a07a76e4e4d989a75a0b37d14b69f.jpeg","name":"W-LJ-0114_1000x667.jpg"}]},{"id":16,"title":"Stacy & Dia's Testimonial","slug":"stacy-dias-testimonial","summary":null,"body":"I just wanted to thank Poppy Larbalestier Photography for our awesome wedding photos. We have received so many lovely comments, she deserves all the credit for her beautiful work, thanks Poppy! A very talented young lady who I wouldn't hesitate to recommend to anyone looking for a photographer","body_prefix":null,"body_suffix":null,"images":[{"id":244,"path":"\/storage\/images\/7438bbc5757d40309d4549f950073ac7.jpeg","name":"W-CN-0155_1000x667.jpg"}]},{"id":17,"title":"Carley & Jonny's Testimonial","slug":"carley-jonnys-testimonial","summary":null,"body":"...the pictures are amazing and I couldn't have asked for more! Exactly what we wanted. I have forwarded to family and bridesmaids and they have said they are the most beautiful wedding photos they have seen - just so natural. I will be sure to recommend you to everyone. Again thank you so much.","body_prefix":null,"body_suffix":null,"images":[{"id":245,"path":"\/storage\/images\/cfca4689caa44b988f2b794816f3862d.jpeg","name":"W-DI-0045_1000x666.jpg"}]},{"id":7,"title":"Carly & Ramsay's Testimonial","slug":"carly-ramsays-testimonial","summary":null,"body":"When we sat down to view our wedding photographs, we were blown away by the quality. It truly felt as though we had been transported back to our special day and a flood of memories came rushing back with every breathtaking shot. Poppy captured the precious moments between us, from a hearty giggle during the speeches to a teary look of pure joy as we said our vows.\n\nWe were astounded at how beautifully Poppy had captured the atmosphere of the wedding, and she was so discreet that our guests had no idea they were being photographed. Poppy really does have an eye for the best light and backdrop to make the most impressive pictures. Knowing that we didn’t want to take too long for posed shots, Poppy ensured that the family snaps were done efficiently so we could spend more time with our guests.\n\nHer relaxed yet assertive approach resulted in a stunning collection of pictures that are unique to us and our wedding day. Your wedding photographs are something to treasure for years to come so you need to have the best person behind that camera. Poppy is, in our opinion, the best.\n\nCarly & Ramsay","body_prefix":null,"body_suffix":null,"images":[{"id":234,"path":"\/storage\/images\/0a14733322c74f4483bf42da2c26f05a.jpeg","name":"W-LC-103_1000x667.jpg"}]},{"id":26,"title":"Jenny & Josh's Testimonial","slug":"jenny-joshs-testimonial","summary":null,"body":"Poppy was absolutely superb! We were so grateful for her expertise, precision and hard work on the day. She was such a joy to work with, we couldn't recommend her enough. She captured our day perfectly and we're thrilled with our photos. Thank you Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":536,"path":"\/storage\/images\/5188170427c14d38ab165307a27b5d14.jpeg","name":"Website size-98.jpg"}]},{"id":29,"title":"Jen & Alex's Testimonial","slug":"jen-alexs-testimonial","summary":null,"body":"Poppy was a pleasure to work with from start to finish - we are not a couple who loves the limelight but she really put us at ease and we chose her as our wedding photographer on our first meeting together. She suggested a great location, Ouaisne Common, for our post-vows photoshoot and we couldn't have picked a better spot ourselves. \n\nThe photos are absolutely stunning and even 18 months after the wedding we cannot stop admiring them. I would not hesitate to recommend Poppy to others who are looking for an extra-special photographer who wants to work with you to get the best shots possible.","body_prefix":null,"body_suffix":null,"images":[{"id":541,"path":"\/storage\/images\/ae57bd11a7624915a678ca1db8ae228a.jpeg","name":"W-DM- 147.jpg"}]},{"id":27,"title":"Martine & Patrick's Testimonial","slug":"martine-patricks-testimonial","summary":null,"body":"Poppy provided us a fabulous service. She was professional, courteous and produced some gorgeous pictures. We can highly recommend her. Martine and Patrick","body_prefix":null,"body_suffix":null,"images":[{"id":537,"path":"\/storage\/images\/e8f4f2780fb340ebb6a424b50a9ba7ae.jpeg","name":"Website size-53.jpg"}]},{"id":28,"title":"Charlie & Alex's Testimonial","slug":"charlie-alexs-testimonial","summary":null,"body":"We couldn’t have had anyone better to capture our wedding day than Poppy. Throughout the day not only was she friendly, professional and engaging, but she really knew what photographs would stand out and help us relive the day when looking at them.\n\nThe photos turned out amazingly! Her dedication to making sure her work is perfect is truly commendable. Whenever anyone we know gets married, we will without a doubt be recommending Poppy!\n\nThanks again Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":538,"path":"\/storage\/images\/6959f68bc9054ee99bd9e11ec99fc2f1.jpeg","name":"Website size-25.jpg"}]},{"id":30,"title":"Ell & Luke's Testimonial","slug":"ell-lukes-testimonial","summary":null,"body":"Poppy did our wedding photos and she made us feel at ease for the whole day. We didn’t really notice she was there, which was exactly what we wanted! We were so pleased with the photos - thanks for capturing our day so beautifully and giving us great advice on locations. We would 100% recommend Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":542,"path":"\/storage\/images\/456fb22a898f44a28061ec8c5d21c689.jpeg","name":"Website size-15.jpg"}]},{"id":31,"title":"Clare & Karl's Testimonial","slug":"clare-karls-testimonial","summary":null,"body":"We loved working with Poppy, and love our wedding photos. She manages to capture intimate moments throughout the day without being intrusive or 'in your face'. And the party pics as the night wore on are brilliant, and really capture the joy and fun. She took loads of great photos of our guests, which we really appreciated as the whole day felt like a bit of a whirlwind for us, so we loved seeing how much everyone enjoyed it.","body_prefix":null,"body_suffix":null,"images":[{"id":544,"path":"\/storage\/images\/2d9acf1c92c3425fa434c5d814d51c7b.jpeg","name":"Website size-57.jpg"}]},{"id":33,"title":"Amy & Dale's Testimonial","slug":"amy-dales-testimonial","summary":null,"body":"Poppy photographed our wedding and we will be forever grateful to her for capturing our day so beautifully! Poppy is brilliant at making you feel at ease in front of the camera and really is so talented. We cannot recommend Poppy enough to anyone looking to capture a special day. Thank you Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":546,"path":"\/storage\/images\/b3532afb94094305a2d1be6869d2defb.jpeg","name":"Website size-2.jpg"}]},{"id":34,"title":"Lauren & Luke's Testimonial","slug":"lauren-lukes-testimonial","summary":null,"body":"From our first meeting with Poppy, we knew she was the photographer we wanted for our wedding. Her stunning images really show her talent for capturing the atmosphere and emotion of the day. We often didn't even notice she was there as she blended into the background, capturing some lovely natural photos.","body_prefix":null,"body_suffix":null,"images":[{"id":547,"path":"\/storage\/images\/57475d417a9c4c53bf01497ab4f4459b.jpeg","name":"Website size-8.jpg"}]},{"id":35,"title":"Phoebe & Kit's Testimonial","slug":"phoebe-kits-testimonial","summary":null,"body":"Poppy did an amazing job at our wedding, capturing all the best moments and coming up the most beautiful settings. she was lovely to deal with and we would definitely recommend her!","body_prefix":null,"body_suffix":null,"images":[{"id":548,"path":"\/storage\/images\/6295d2ef5d5a456ebbc55e1b8f42f6f7.jpeg","name":"Website size-48.jpg"}]},{"id":36,"title":"Carole & Jules's Testimonial","slug":"carole-juless-testimonial","summary":null,"body":"Poppy took wonderful photos for our small & intimate Wedding Day. We continue to be delighted with the images that Poppy took and she really helped to make us feel relaxed. Although the weather wasn't great on our Big Day, when we look at Poppy's images, we forget that it was cold and windy, as Poppy really captured our happiness. We really cannot recommend Poppy highly enough - she has a wealth of professional experience and would be our first choice of photographer for any event. Thank you Poppy!","body_prefix":null,"body_suffix":null,"images":[{"id":553,"path":"\/storage\/images\/cb188a2426824f158b2bd8b02ae91890.jpeg","name":"Website size-622 copy.jpg"}]},{"id":37,"title":"Steph & Andy's Testimonial","slug":"steph-andys-testimonial","summary":null,"body":"We have nothing but the highest praise for Poppy she is absolutely brilliant in every way, extremely professional and talented, whilst also being helpful, full of ideas, flexible, and so very lovely to top it off! \n\nI had followed her Work on Facebook for years after first seeing her amazing work on Ellen and Alex’s wedding photos and knew I wanted her for my wedding one day, and after seeing her talent my fiancé was more than happy to sign up.\n\nShe has always been so approachable allowing me to bombard her with ideas and suggestions and give advice in return, and we were thrilled to meet her at a friends weekend 13 months before ours. Meeting her a month in advance of the weekend was super easy and filled us with even more confidence... and this is all just the run up! On the actual wedding day she was again just so lovely and professional, subtly in the background so much of the time.\n\nWe received our photos in ridiculously good time and with such care and consideration, and we honestly could not be happier with the incredible job she has done with the photos, they are absolutely stunning. Our families and friends are utterly bowled over by them. \n\nPoppy you are amazing, thank you for everything!","body_prefix":null,"body_suffix":null,"images":[{"id":552,"path":"\/storage\/images\/345269b0bfae4db2a123cc709f5d090d.jpeg","name":"W-HDC-644-8.jpg"}]}],"images":[]}